# StructuralSectionCProfileWithLips Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionCProfileWithLips Class
Members See Also
---
Defines parameters for C Profile with lips structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionCProfileWithLips : StructuralSectionGeneralC
```

Visual Basic
---
```text
Public Class StructuralSectionCProfileWithLips _
	Inherits StructuralSectionGeneralC
```

Visual C++
---
```text
public ref class StructuralSectionCProfileWithLips : public StructuralSectionGeneralC
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralC Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCProfileWithLips
# See Also
StructuralSectionCProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace